README.org
#+title: Fog Orchestrator Node Selection
#+author: Aditya Nair

* Table of Contents :toc:
- [[#installation][Installation]]
- [[#why-rust][Why Rust?]]
- [[#13][]]

* Installation
1. Install rustc and cargo
2. Clone repo
3. Navigate to src/ directory
4. run 'cargo run'
* Why Rust?
+ Rust is a modern programming language that provides the performance and control of low-level languages like C with the safety and ease of use of high-level languages like Python.
+ Rust's borrow checker provides memory safety checks at compile time resulting in safe code that does not need to be debugged frequently.
+ Building the project in a language like Rust instead of a simulation software like MATLAB will help in scaling the project in any direction; and also will help in building an intuition of how the data is propogated through the network.
* TODO [1/3]
- [X] Implement FONS TOPSIS algorithm
- [-] Implement Application Placement algorithm
- [ ] Run algorithm with dummy data
