README.md

# Table of Contents

1.  [Installation](#orgeb1abb4)
2.  [Why Rust?](#org953f16c)
3.  [TODO](#org920e0fa)



<a id="orgeb1abb4"></a>

# Installation

1.  Install rustc and cargo
2.  Clone repo
3.  Navigate to src/ directory
4.  run &rsquo;cargo run&rsquo;


<a id="org953f16c"></a>

# Why Rust?

-   Rust is a modern programming language that provides the performance and control of low-level languages like C with the safety and ease of use of high-level languages like Python.
-   Rust&rsquo;s borrow checker provides memory safety checks at compile time resulting in safe code that does not need to be debugged frequently.
-   Building the project in a language like Rust instead of a simulation software like MATLAB will help in scaling the project in any direction; and also will help in building an intuition of how the data is propogated through the network.


<a id="org920e0fa"></a>

# TODO

Tasks left to do <code>[1/3]</code>

-   [X] Implement FONS TOPSIS algorithm
-   [-] Implement Application Placement algorithm
-   [ ] Run algorithm with dummy data

